---
kind: property
id: P:Autodesk.Revit.DB.SolidOptions.GraphicsStyleId
source: html/0943fdf4-e5c6-b0f8-fb00-54e982ff560f.htm
---
# Autodesk.Revit.DB.SolidOptions.GraphicsStyleId Property

Defines the graphics style id for the Solid.

## Syntax (C#)
```csharp
public ElementId GraphicsStyleId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null